[A_Item.ShieldBooster_Pickup UsableItemDefinition]
UseFailureCharacterMessage="you %s use this."
ItemName="Screen amplifier"
PickupMessage="You did it %s"
UseFailureLevelMessage="You must have at least %d to use this item."
UseFailureConstraintsMessage="Better protection."
NoManufacturerName="All"

[A_Item.ShieldBooster_Pickup:AttributePresentationDefinition_13 AttributePresentationDefinition]
Description="The player has a shield.."
NoConstraintText=""
Suffix=""
Prefix=""

[Skills.BoosterShieldPickup_Skill SkillDefinition]
SkillName="Reinforced light armor"
SkillDescription=""
LockedSkillDetailStr="<Bloqueado>"

